amcelroy/ra-pac/svd_patch/R7FA6M2AF.svd
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P60%sPFS_HA</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x182</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P60%sPFS_BY</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x183</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P6%sPFS</name>
                    <description>P6%s Pin Function Control Register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P6%sPFS_HA</name>
                    <description>P6%s Pin Function Control Register</description>
                    <alternateRegister>P6%sPFS</alternateRegister>
                    <addressOffset>0x1AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P6%sPFS_BY</name>
                    <description>P6%s Pin Function Control Register</description>
                    <alternateRegister>P6%sPFS</alternateRegister>
                    <addressOffset>0x1AB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P70%sPFS</name>
                    <description>P70%s Pin Function Control Register</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P70%sPFS_HA</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P70%sPFS_BY</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P80%sPFS</name>
                    <description>P80%s Pin Function Control Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P80%sPFS_HA</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x202</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P80%sPFS_BY</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x203</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>P90%sPFS</name>
                    <description>P90%s Pin Function Control Register</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>P90%sPFS_HA</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x242</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>P90%sPFS_BY</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x243</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>5-8</dimIndex>
                    <name>P90%sPFS_1</name>
                    <description>P90%s Pin Function Control Register</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>5-8</dimIndex>
                    <name>P90%sPFS_HA_1</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x256</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>5-8</dimIndex>
                    <name>P90%sPFS_BY_1</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x257</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PA0%sPFS</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PA0%sPFS_HA</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <alternateRegister>PA0%sPFS</alternateRegister>
                    <addressOffset>0x282</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PA0%sPFS_BY</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <alternateRegister>PA0%sPFS</alternateRegister>
                    <addressOffset>0x283</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>PA0%sPFS_1</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>PA0%sPFS_HA_1</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <alternateRegister>PA0%sPFS</alternateRegister>
                    <addressOffset>0x2A2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>PA0%sPFS_BY_1</name>
                    <description>PA0%s Pin Function Control Register</description>
                    <alternateRegister>PA0%sPFS</alternateRegister>
                    <addressOffset>0x2A3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <name>PA10PFS</name>
                    <description>PA10 Pin Function Control Register</description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <name>PA10PFS_HA</name>
                    <description>PA10 Pin Function Control Register</description>
                    <alternateRegister>PA10PFS</alternateRegister>
                    <addressOffset>0x2AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <name>PA10PFS_BY</name>
                    <description>PA10 Pin Function Control Register</description>
                    <alternateRegister>PA10PFS</alternateRegister>
                    <addressOffset>0x2AB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PB0%sPFS</name>
                    <description>PB0%s Pin Function Control Register</description>
                    <addressOffset>0x2C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PB0%sPFS_HA</name>
                    <description>PB0%s Pin Function Control Register</description>
                    <alternateRegister>PB0%sPFS</alternateRegister>
                    <addressOffset>0x2C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>PB0%sPFS_BY</name>
                    <description>PB0%s Pin Function Control Register</description>
                    <alternateRegister>PB0%sPFS</alternateRegister>
                    <addressOffset>0x2C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
