amcelroy/ra-pac/svd_patch/R7FA6M2AF.svd
                <register>
                    <name>SISR</name>
                    <description>I2C Status Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xCB</resetMask>
                    <fields>
                        <field>
                            <name>IICACKR</name>
                            <description>ACK Reception Data Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPMR</name>
                    <description>SPI Mode Register</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKPH</name>
                            <description>Clock Phase Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKPOL</name>
                            <description>Clock Polarity Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MFF</name>
                            <description>Mode Fault Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSS</name>
                            <description>Master or slave mode selection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CTSE</name>
                            <description>CTS Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SSE</name>
                            <description>SSn# Pin Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDRHL</name>
                    <description>Transmit 9-bit Data Register</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDRHL</name>
                            <description>TDRHL is a 16-bit register that stores transmit data.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FTDRHL</name>
                    <description>Transmit FIFO Data Register HL</description>
                    <alternateRegister>TDRHL</alternateRegister>
                    <addressOffset>0x0E</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPBT</name>
                            <description>Multi,processor transfer bit flag(Valid only in asynchronous mode and SMR.MP=1 and FIFO selected)</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TDAT</name>
                            <description>Serial transmit data (Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FTDRH</name>
                    <description>Transmit FIFO Data Register H</description>
                    <alternateRegister>TDRHL</alternateRegister>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MPBT</name>
                            <description>Multi,processor transfer bit flag(Valid only in asynchronous mode and SMR.MP=1 and FIFO selected)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TDATH</name>
                            <description>Serial transmit data (b8) (Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FTDRL</name>
                    <description>Transmit FIFO Data Register L </description>
                    <alternateRegister>TDRHL</alternateRegister>
                    <addressOffset>0x0F</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDATL</name>
                            <description>Serial transmit data(b7-b0) (Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDRHL</name>
                    <description>Receive 9-bit Data Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RDRHL</name>
                            <description>RDRHL is an 16-bit register that stores receive data.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRDRHL</name>
                    <description>Receive FIFO Data Register HL</description>
                    <alternateRegister>RDRHL</alternateRegister>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RDF</name>
                            <description>Receive FIFO data full flag(It is same as SSR.RDF)</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORER</name>
                            <description>Overrun error flag(It is same as SSR.ORER)</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FER</name>
                            <description>Framing error flag</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>Parity error flag</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DR</name>
                            <description>Receive data ready flag(It is same as SSR.DR)</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPB</name>
                            <description>Multi,processor bit flag(Valid only in asynchronous mode with SMR.MP=1 and FIFO selected) It can read multi,processor bit corresponded to serial receive data(RDATA[8:0])</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDAT</name>
                            <description>Serial receive data(Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRDRH</name>
                    <description>Receive FIFO Data Register H</description>
                    <alternateRegister>RDRHL</alternateRegister>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RDF</name>
                            <description>Receive FIFO data full flag(It is same as SSR.RDF)</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORER</name>
                            <description>Overrun error flag(It is same as SSR.ORER)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FER</name>
                            <description>Framing error flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>Parity error flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DR</name>
                            <description>Receive data ready flag(It is same as SSR.DR)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPB</name>
                            <description>Multi,processor bit flag(Valid only in asynchronous mode with SMR.MP=1 and FIFO selected) It can read multi,processor bit corresponded to serial receive data(RDATA[8:0])</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDATH</name>
                            <description>Serial receive data(b8)(Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRDRL</name>
                    <description>Receive FIFO Data Register L</description>
                    <alternateRegister>RDRHL</alternateRegister>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RDATL</name>
                            <description>Serial receive data(Valid only in asynchronous mode(including multi,processor) or clock synchronous mode, and FIFO selected)NOTE: When reading both of FRDRH register and FRDRL register, please read by an order of the FRDRH register and the FRDRL register.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MDDR</name>
                    <description>Modulation Duty Register</description>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MDDR</name>
                            <description>MDDR corrects the bit rate adjusted by the BRR register.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCCR</name>
                    <description>Data Compare Match Control Register</description>
                    <addressOffset>0x13</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DCME</name>
                            <description>Data Compare Match Enable(Valid only in asynchronous mode(including multi,processor) </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IDSEL</name>
                            <description>ID frame select Bit(Valid only in asynchronous mode(including multi,processor) </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DFER</name>
                            <description>Data Compare Match Framing Error Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPER</name>
                            <description>Data Compare Match Parity Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DCMF</name>
                            <description>Data Compare Match Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
