amcelroy/ra-pac/svd_patch/R7FA6M2AF.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI1</name>
            <description>Serial Communication Interface 1</description>
            <baseAddress>0x40070020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI2</name>
            <description>Serial Communication Interface 2</description>
            <baseAddress>0x40070040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI3</name>
            <description>Serial Communication Interface 3</description>
            <baseAddress>0x40070060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI4</name>
            <description>Serial Communication Interface 4</description>
            <baseAddress>0x40070080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI5</name>
            <description>Serial Communication Interface 5</description>
            <baseAddress>0x400700A0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI6</name>
            <description>Serial Communication Interface 6</description>
            <baseAddress>0x400700C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI7</name>
            <description>Serial Communication Interface 7</description>
            <baseAddress>0x400700E0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI8</name>
            <description>Serial Communication Interface 8</description>
            <baseAddress>0x40070100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI9</name>
            <description>Serial Communication Interface 9</description>
            <baseAddress>0x40070120</baseAddress>
        </peripheral>
        <peripheral>
            <name>IIC0</name>
            <description>Inter,Integrated Circuit 0</description>
            <baseAddress>0x40053000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0B</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x15</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ICCR1</name>
                    <description>I2C Bus Control Register 1 </description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ICE</name>
                            <description>I2C Bus Interface Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICRST</name>
                            <description>I2C Bus Interface Internal ResetNote:If an internal reset is initiated using the IICRST bit for a bus hang,up occurred during communication with the master device in slave mode, the states may become different between the slave device and the master device (due to the difference in the bit counter information).</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CLO</name>
                            <description>Extra SCL Clock Cycle Output</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SOWP</name>
                            <description>SCLO/SDAO Write Protect</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLO</name>
                            <description>SCL Output Control/Monitor</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SDAO</name>
                            <description>SDA Output Control/Monitor</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLI</name>
                            <description>SCL Line Monitor</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SDAI</name>
                            <description>SDA Line Monitor</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICCR2</name>
                    <description>I2C Bus Control Register 2</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BBSY</name>
                            <description>Bus Busy Detection Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MST</name>
                            <description>Master/Slave Mode</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TRS</name>
                            <description>Transmit/Receive Mode </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SP</name>
                            <description>Stop Condition Issuance RequestNote: Writing to the SP bit is not possible while the setting of the BBSY flag is 0 (bus free state).Note: Do not set the SP bit to 1 while a restart condition is being issued.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>Restart Condition Issuance RequestNote: Do not set the RS bit to 1 while issuing a stop condition.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>Start Condition Issuance RequestSet the ST bit to 1 (start condition issuance request) when the BBSY flag is set to 0 (bus free state).</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICMR1</name>
                    <description>I2C Bus Mode Register 1</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MTWP</name>
                            <description>MST/TRS Write Protect</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>Internal Reference Clock (fIIC) Selection ( fIIC = PCLKB / 2^CKS )</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BCWP</name>
                            <description>BC Write Protect(This bit is read as 1.)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BC</name>
                            <description>Bit Counter</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICMR2</name>
                    <description>I2C Bus Mode Register 2</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x06</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DLCS</name>
                            <description>SDA Output Delay Clock Source Selection</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SDDL</name>
                            <description>SDA Output Delay Counter</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOH</name>
                            <description>Timeout H Count Control</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOL</name>
                            <description>Timeout L Count Control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOS</name>
                            <description>Timeout Detection Time Selection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICMR3</name>
                    <description>I2C Bus Mode Register 3</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SMBS</name>
                            <description>SMBus/I2C Bus Selection</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WAIT</name>
                            <description>WAITNote: When the value of the WAIT bit is to be read, be sure to read the ICDRR beforehand.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDRFS</name>
                            <description>RDRF Flag Set Timing Selection</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACKWP</name>
                            <description>ACKBT Write Protect</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACKBT</name>
                            <description>Transmit Acknowledge</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACKBR</name>
                            <description>Receive Acknowledge</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NF</name>
                            <description>Noise Filter Stage Selection</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICFER</name>
                    <description>I2C Bus Function Enable Register </description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x72</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FMPE</name>
                            <description>Fast,mode Plus Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLE</name>
                            <description>SCL Synchronous Circuit Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NFE</name>
                            <description>Digital Noise Filter Circuit Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NACKE</name>
                            <description>NACK Reception Transfer Suspension Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SALE</name>
                            <description>Slave Arbitration,Lost Detection Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NALE</name>
                            <description>NACK Transmission Arbitration,Lost Detection Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MALE</name>
                            <description>Master Arbitration,Lost Detection Enable </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOE</name>
                            <description>Timeout Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
