amcelroy/ra-pac/svd_patch/R7FA6M2AF.svd
                <register>
                    <name>CTSUSC</name>
                    <description>CTSU Sensor Counter</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSUSC</name>
                            <description>CTSU Sensor CounterThese bits indicate the measurement result of the CTSU. These bits indicate FFFFh when an overflow occurs.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSURC</name>
                    <description>CTSU Reference Counter</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSURC</name>
                            <description>CTSU Reference Counter</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUERRS</name>
                    <description>CTSU Error Status Register </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSUICOMP</name>
                            <description>TSCAP Voltage Error Monitor</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>MMPU</name>
            <description>Bus Master MPU</description>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>3072</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x600</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA00</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x204</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x604</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA04</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x208</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x608</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA08</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x102</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x502</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x902</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x400</dimIncrement>
                    <dimIndex>A,B,C</dimIndex>
                    <name>MMPUCTL%s</name>
                    <description>Bus Master MPU Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Master Group enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MMPUACA%s</name>
                    <description>Group A Region %s Access Control Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Write protection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>Read protection</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Region enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUACB%s</name>
                    <description>Group B Region %s Access Control Register</description>
                    <addressOffset>0x600</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Write protection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>Read protection</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Region enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUACC%s</name>
                    <description>Group C Region %s Access Control Register</description>
                    <addressOffset>0xA00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Write protection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>Read protection</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Region enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MMPUSA%s</name>
                    <description>Group A Region %s Start Address Register</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUSA</name>
                            <description>Address where the region starts, for use in region determination.NOTE: The low,order 2 bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUSB%s</name>
                    <description>Group B Region %s Start Address Register</description>
                    <addressOffset>0x604</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUSB</name>
                            <description>Address where the region starts, for use in region determination.NOTE: The low,order 2 bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUSC%s</name>
                    <description>Group C Region %s Start Address Register</description>
                    <addressOffset>0xA04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUSC</name>
                            <description>Address where the region starts, for use in region determination.NOTE: The low,order 2 bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MMPUEA%s</name>
                    <description>Group A Region %s End Address Register</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUEA</name>
                            <description>Region end address registerAddress where the region end, for use in region determination.NOTE: The low,order 2 bits are fixed to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUEB%s</name>
                    <description>Group B Region %s End Address Register</description>
                    <addressOffset>0x608</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUEB</name>
                            <description>Region end address registerAddress where the region end, for use in region determination.NOTE: The low,order 2 bits are fixed to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUEC%s</name>
                    <description>Group C Region %s End Address Register</description>
                    <addressOffset>0xA08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MMPUEC</name>
                            <description>Region end address registerAddress where the region end, for use in region determination.NOTE: The low,order 2 bits are fixed to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUPTA</name>
                    <description>Group A Protection of Register</description>
                    <addressOffset>0x102</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register(MMPUSAn, MMPUEAn and MMPUACAn)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUPTB</name>
                    <description>Group B Protection of Register</description>
                    <addressOffset>0x502</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register(MMPUSBn, MMPUEBn and MMPUACBn)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUPTC</name>
                    <description>Group C protection of register</description>
                    <addressOffset>0x902</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register (MMPUSCn, MMPUECn and MMPUACCn)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
