amcelroy/ra-pac/svd_patch/R7FA6M2AF.svd
                <register>
                    <name>RMONCNT</name>
                    <description>Month Counter</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xE0</resetMask>
                    <fields>
                        <field>
                            <name>MON10</name>
                            <description>10-Month Count Counts from 0 to 1 once per carry from the ones place.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MON1</name>
                            <description>1-Month Count Counts from 0 to 9 once per month. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RYRCNT</name>
                    <description>Year Counter</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>YR10</name>
                            <description>10-Year Count Counts from 0 to 9 once per carry from ones place. When a carry is generated in the tens place, 1 is added to the hundreds place.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>YR1</name>
                            <description>1-Year Count Counts from 0 to 9 once per year. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSECAR</name>
                    <description>Second Alarm Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEC10</name>
                            <description>10-Seconds Value for the tens place of seconds</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEC1</name>
                            <description>1-Second Value for the ones place of seconds</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT0AR</name>
                    <description>Binary Counter 0 Alarm Register</description>
                    <alternateRegister>RSECAR</alternateRegister>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT0AR</name>
                            <description>he BCNT0AR counter is a readable/writable alarm register corresponding to 32-bit binary counter b7 to b0.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMINAR</name>
                    <description>Minute Alarm Register</description>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MIN10</name>
                            <description>10-Minute Count Value for the tens place of minutes</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIN1</name>
                            <description>1-Minute Count Value for the ones place of minutes</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT1AR</name>
                    <description>Binary Counter 1 Alarm Register</description>
                    <alternateRegister>RMINAR</alternateRegister>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT1AR</name>
                            <description>he BCNT1AR counter is a readable/writable alarm register corresponding to 32-bit binary counter b15 to b8.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RHRAR</name>
                    <description>Hour Alarm Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>Time Counter Setting for a.m./p.m.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Hour Count Value for the tens place of hours</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HR1</name>
                            <description>1-Hour Count Value for the ones place of hours</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT2AR</name>
                    <description>Binary Counter 2 Alarm Register</description>
                    <alternateRegister>RHRAR</alternateRegister>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT2AR</name>
                            <description>The BCNT2AR counter is a readable/writable 32-bit binary counter b23 to b16.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWKAR</name>
                    <description>Day,of,Week Alarm Register</description>
                    <addressOffset>0x16</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DAYW</name>
                            <description>Day,of,Week Counting</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT3AR</name>
                    <description>Binary Counter 3 Alarm Register</description>
                    <alternateRegister>RWKAR</alternateRegister>
                    <addressOffset>0x16</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT3AR</name>
                            <description>The BCNT3AR counter is a readable/writable 32-bit binary counter b31 to b24.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDAYAR</name>
                    <description>Date Alarm Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DATE10</name>
                            <description>10 Days Value for the tens place of days</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATE1</name>
                            <description>1 Day Value for the ones place of days</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT0AER</name>
                    <description>Binary Counter 0 Alarm Enable Register</description>
                    <alternateRegister>RDAYAR</alternateRegister>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT0AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b7 to b0.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMONAR</name>
                    <description>Month Alarm Register</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MON10</name>
                            <description>10 Months Value for the tens place of months</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MON1</name>
                            <description>1 Month Value for the ones place of months</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT1AER</name>
                    <description>Binary Counter 1 Alarm Enable Register</description>
                    <alternateRegister>RMONAR</alternateRegister>
                    <addressOffset>0x1A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT1AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b15 to b8.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RYRAR</name>
                    <description>Year Alarm Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>YR10</name>
                            <description>10 Years Value for the tens place of years</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>YR1</name>
                            <description>1 Year Value for the ones place of years</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT2AER</name>
                    <description>Binary Counter 2 Alarm Enable Register</description>
                    <alternateRegister>RYRAR</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT2AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b23 to b16.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RYRAREN</name>
                    <description>Year Alarm Enable Register</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>Compare enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT3AER</name>
                    <description>Binary Counter 3 Alarm Enable Register</description>
                    <alternateRegister>RYRAREN</alternateRegister>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>ENB</name>
                            <description>The BCNT3AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b31 to b24. </description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
